#### Terragrunt Plan 📖 (infra/demo/path2) `success`

<details><summary>Show Plan</summary>

```
11:56:50.065 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
11:56:50.066 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
11:56:50.066 STDOUT tofu:   + create
11:56:50.066 STDOUT tofu: OpenTofu will perform the following actions:
11:56:50.066 STDOUT tofu:   # google_storage_bucket.auto-expire will be created
11:56:50.066 STDOUT tofu:   + resource "google_storage_bucket" "auto-expire" {
11:56:50.066 STDOUT tofu:       + effective_labels            = {
11:56:50.066 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
11:56:50.066 STDOUT tofu:         }
11:56:50.066 STDOUT tofu:       + force_destroy               = true
11:56:50.066 STDOUT tofu:       + id                          = (known after apply)
11:56:50.066 STDOUT tofu:       + location                    = "US"
11:56:50.066 STDOUT tofu:       + name                        = "thr-no-public-access-bucket"
11:56:50.066 STDOUT tofu:       + project                     = "psyched-circuit-405312"
11:56:50.066 STDOUT tofu:       + project_number              = (known after apply)
11:56:50.066 STDOUT tofu:       + public_access_prevention    = "enforced"
11:56:50.066 STDOUT tofu:       + rpo                         = (known after apply)
11:56:50.067 STDOUT tofu:       + self_link                   = (known after apply)
11:56:50.067 STDOUT tofu:       + storage_class               = "STANDARD"
11:56:50.067 STDOUT tofu:       + terraform_labels            = {
11:56:50.067 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
11:56:50.067 STDOUT tofu:         }
11:56:50.067 STDOUT tofu:       + time_created                = (known after apply)
11:56:50.067 STDOUT tofu:       + uniform_bucket_level_access = (known after apply)
11:56:50.067 STDOUT tofu:       + updated                     = (known after apply)
11:56:50.067 STDOUT tofu:       + url                         = (known after apply)
11:56:50.067 STDOUT tofu:       + soft_delete_policy (known after apply)
11:56:50.067 STDOUT tofu:       + versioning (known after apply)
11:56:50.067 STDOUT tofu:       + website (known after apply)
11:56:50.067 STDOUT tofu:     }
11:56:50.067 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
11:56:50.067 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
11:56:50.067 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
11:56:50.067 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @muralisathenapally, Directory: `infra/demo/path2`*